<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"56829038cee6435fa9a7e5dfabb6b8c8f9aff748f53b88489b828fad8bb1ac47","plan_job_ref":"Job PR Plan #15 at https://github.com/DGOPS-Kubernetes/terraform-test/actions/runs/11812278473","plan_out_hash":"7014efb4aeb916c7e87f1398e023b5834d0dd75f06021c66e6ddaea768301614","plan_hash":"9af36edf1a8d962159a017dcdea7aabce6ec9fff77c3127f30e693dd555db9f3","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.bar will be created
+   resource "local_file" "bar" {
+       content              = "bar!"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./bar.foo"
+       id                   = (known after apply)
    }

  # local_file.foo will be created
+   resource "local_file" "foo" {
+       content              = "foo!"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./foo.bar"
+       id                   = (known after apply)
    }

  # local_file.test will be created
+   resource "local_file" "test" {
+       content              = "test"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./test.txt"
+       id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   example_output_homedir = false
```
</details>

:white_check_mark: Plan applied in [Push Apply #5](https://github.com/DGOPS-Kubernetes/terraform-test/actions/runs/11812309502)
<details open><summary>Outputs</summary>

```hcl
example_output_homedir = false
```
</details>